{
    "journals_eng": [
        {
            "name":     "A CNN-Based Subpixel Level DSM Generation Approach via Single Image Super-Resolution",
            "nameAbb":  "2019_acsldgavsis",
            "sortAs":   "A",
            "author":   "Yongjun Zhang, Zhi Zheng, Yimin Luo, Yanfeng Zhang, Yi Wan, Jun Wu, Zhiyong Peng, Xiu Liu",
            "journal":  "Photogrammetric Engineering and Remote Sensing",
            "year":     "2019",
            "volumn":   "85",
            "issue":    "10",
            "pages":    "51-491",
            "abstract": "Previous work for subpixel level Digital Surface Model (DSM) generation mainly focused on data fusion techniques, which are extremely limied by the difficulty of multisource data acquisition. Although several DSMsuper resolution (SR) methods have been developed to ease the problem, a new issue that plenty of DSM samples are needed to train the model is raised. Therefore, considering the original images have vital influence on its DSMs accuracy, we address the problem by directly improving images resolution. Several SR models are refined and brought into the traditional DSM generation process as an image quality improvement stage to construct an easy but effective workflow for subpixel level DSM generation. Experiments verified the validity and significance of bringing SR technology into this kind of application. Statistical analysis also confirmed that a subpixel level DSM with higher fidelity can be obtained more easily compared to directly DSM interpolation.",
            "webpage":  "https://doi.org/10.14358/PERS.85.10.1"
        }, 
        {
            "name":     "An optimizer ensemble algorithm and its application to image registration",
            "nameAbb":  "2019_aoeaiatir",
            "sortAs":   "A",
            "author":   "Xiaohu Yan, Fazhi He, Yongjun Zhang, Xunwei Xie",
            "journal":  "Integrated Computer Aided Engineering",
            "year":     "2019",
            "volumn":   "26",
            "issue":    "1",
            "pages":    "1-17",
            "abstract": "The design of effective optimization algorithms is always a hot research topic. An optimizer ensemble where any population-based optimization algorithm can be integrated is proposed in this study. First, the optimizer ensemble framework based on ensemble learning is presented. The learning table consisting of the population members of all optimizers is constructed to share information. The maximum number of iterations is divided into several exchange iterations. Each optimizer exchanges individuals with the learning table in exchange iterations and runs independently in the other iterations. Exchange individuals are generated by a bootstrap sample from the learning table. To maintain a balance between exchange individuals and preserved individuals, the exchange number of each optimizer is adaptively assigned according to its fitness. The output is obtained by the voting approach that selects the highest ranked solution. Second, an optimizer ensemble algorithm (OEA) which combines multiple population-based optimization algorithms is proposed. The computational complexity, convergence, and diversity of OEA are analyzed. Finally, extensive experiments on benchmark functions demonstrate that OEA outperforms several state-of-the-art algorithms. OEA is used to search the maximum mutual information in image registration. The high performance of OEA is further verified by a large number of registration results on real remote sensing images.",
            "webpage":  "https://content.iospress.com/articles/integrated-computer-aided-engineering/ica190723"
        }, 
        {
            "name":     "A Lightweight and Discriminative Model for Remote Sensing Scene Classification With Multidilation Pooling Module",
            "nameAbb":  "2019_aldmrsscmpm",
            "sortAs":   "A",
            "author":   "Bin Zhang, Yongjun Zhang, Shugen Wang",
            "journal":  "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing",
            "year":     "2019",
            "volumn":   "12",
            "issue":    "8",
            "pages":    "2636-2653",
            "abstract": "With the growing spatial resolution of satellite images, high spatial resolution (HSR) remote sensing imagery scene classification has become a challenging task due to the highly complex geometrical structures and spatial patterns in HSR imagery. The key issue in scene classification is how to understand the semantic content of the images effectively, and researchers have been looking for ways to improve the process. Convolutional neural networks (CNNs), which have achieved amazing results in natural image classification, were introduced for remote sensing image scene classification. Most of the researches to date have improved the final classification accuracy by merging the features of CNNs. However, the entire models become relatively complex and cannot extract more effective features. To solve this problem, in this paper, we propose a lightweight and effective CNN which is capable of maintaining high accuracy. We use MobileNet V2 as a base network and introduce the dilated convolution and channel attention to extract discriminative features. To improve the performance of the CNN further, we also propose a multidilation pooling module to extract multiscale features. Experiments are performed on six datasets, and the results verify that our method can achieve higher accuracy compared to the current state-of-the-art methods.",
            "webpage":  "https://ieeexplore.ieee.org/abstract/document/8746195/"
        }, 
        {
            "name":     "TopoLAP: Topology Recovery for Building Reconstruction by Deducing the Relationships between Linear and Planar Primitives",
            "nameAbb":  "2019_TopoLAP",
            "sortAs":   "T",
            "author":   "Xinyi Liu, Yongjun Zhang, Xiao Ling, Yi Wan, Linyu Liu, Qian Li",
            "journal":  "Remote Sensing",
            "year":     "2019",
            "volumn":   "11",
            "issue":    "11",
            "pages":    "1372",
            "abstract": "Limited by the noise, missing data and varying sampling density of the point clouds, planar primitives are prone to be lost during plane segmentation, leading to topology errors when reconstructing complex building models. In this paper, a pipeline to recover the broken topology of planar primitives (TopoLAP) is proposed to reconstruct level of details 3 (LoD3) models. Firstly, planar primitives are segmented from the incomplete point clouds and feature lines are detected both from point clouds and images. Secondly, the structural contours of each plane segment are reconstructed by subset selection from intersections of these feature lines. Subsequently, missing planes are recovered by plane deduction according to the relationships between linear and planar primitives. Finally, the manifold and watertight polyhedral building models are reconstructed based on the optimized PolyFit framework. Experimental results demonstrate that the proposed pipeline can handle partial incomplete point clouds and reconstruct the LoD3 models of complex buildings automatically. A comparative analysis indicates that the proposed method performs better to preserve sharp edges and achieves a higher fitness and correction rate than rooftop-based modeling and the original PolyFit algorithm",
            "webpage":  "https://www.mdpi.com/2072-4292/11/11/1372"
        }
    ]


}